
import numpy as np
from array import *

#--------------------------------------------创建数组）））））））））））））））））
#通过列表创建数组
np.array([1,2,3])#NP的array，功能强大
#array([1,2,3])

#通过列表创建二维数组
np.array([(1,2,3),(4,5,6)])
#array([[1,2,3],[4,5,6]])

#创建全0的二维数组
np.zeros((3,3))
#array([0,0,0], [0,0,0], [0,0,0])

#创建全1的三维数组
np.ones((2,3,4))
#array([[1,1,1,1,],[1,1,1,1],[1,1,1,1]],
#       [[1,1,1,1],[1,1,1,1],[1,1,1,1]])

#创建一维单差数组
np.arange(5)#arr-range!!!
#array([0,1,2,3,4])

#创造二维等差数组
np.arange(6).reshape(2,3)
#array([[0,1,2],[3,4,5]])

#创建单位矩阵
np.eye(3)
#arrar([1,0,0],[0,1,0],[0,0,1]

#创建等间距一维数组
np.linspace(1,10,num = 6)
#array([ 1. ,  2.8,  4.6,  6.4,  8.2, 10. ])

#创建随机二维数组
np.random.rand(2,3)
#array([[0.68355118, 0.36622426, 0.09434563],
#      [0.51161279, 0.86324554, 0.06360249]])

#创建二维水机整数数组
np.random.randint(5,size=(2,3))#小于5的
# array([[2, 3, 0],
#        [2, 4, 0]])

#依据函数定义创建数组
np.fromfunction(lambda i,j:i+j,(3,3))
# array([[0., 1., 2.],
#        [1., 2., 3.],
#        [2., 3., 4.]])

